In [1]:
import sqlite3 

conn=sqlite3.connect('example.db') 

cursor = conn.cursor() 

table='''CREATE TABLE Student1( 

        first_name CHAR(20), 

        last_name CHAR(20), 

        roll_no INT, 

        sex CHAR(20) 

        )''' 

conn.execute(table) 

print('Table created successfully') 

conn.commit() 

conn.close()

Table created successfully

In [3]:
import sqlite3 

conn=sqlite3.connect('example.db') 

cursor = conn.cursor() 

table='''CREATE TABLE Student1( 

        first_name CHAR(20), 

        last_name CHAR(20), 

        roll_no INT, 

        sex CHAR(20) 

        )''' 

conn.execute('''INSERT INTO Student1

               (first_name,last_name,roll_no,sex) 

               VALUES('Ram','Patil',34,'M'), 

               ('Riya','Sharma',45,'F'), 

               ('Diya','Mirza',23,'F')''') 

table=''' UPDATE Student SET roll_no=roll_no-1 WHERE sex='M' ''' 

cursor.execute(table) 

cursor.execute('''SELECT * FROM Student1''') 

 

print(cursor.fetchall()) 

conn.commit() 

conn.close()

OperationalError: ignored